SV-CarsAPI/bzt/ForwardCars-JMeter.yaml
---
execution:
  scenario: ForwardCars
  concurrency: 10
  ramp-up: 1m
  hold-for: 3m
scenarios:
  ForwardCars:
    headers:
      User-Agent: 'Mozilla/5.0 (Macintosh; Intel Mac OS X 10_13_6) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/68.0.3440.106 Safari/537.36'
      Referer: 'http://localhost:3434/cars-app/'
      Accept-Encoding: 'gzip, deflate, br'
      Accept-Language: 'en-US,en;q=0.9,fr;q=0.8'
    requests:
      - transaction: Test
        force-parent-sample: false
        do:
          - url: 'http://localhost:3434/cars-app/carsEsb'
            method: GET
            label: 'http://localhost:3434/cars-app/carsEsb'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/cars'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/cars'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/dealers'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/dealers'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/car/2T1KR32E37C639014'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/car/2T1KR32E37C639014'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes/2/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/2/models'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/assets/cars/vinCheck/vinCheck.html'
            method: GET
            label: 'http://localhost:3434/cars-app/assets/cars/vinCheck/vinCheck.html'
            headers:
              Accept: text/html
          - url: 'http://localhost:3434/cars-app/carShop/car/2T1KR32E37C639014'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/car/2T1KR32E37C639014'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/features/'
            method: GET
            label: 'http://localhost:3434/cars-app/features/'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carsEsb'
            method: GET
            label: 'http://localhost:3434/cars-app/carsEsb'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/cars'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/cars'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/dealers'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/dealers'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/car/3N1CB51D35l458771'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/car/3N1CB51D35l458771'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/dealers'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/dealers'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/car/1ZVBP8AM1D5256900'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/car/1ZVBP8AM1D5256900'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'
          - url: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            method: GET
            label: 'http://localhost:3434/cars-app/carShop/makes/1/models'
            headers:
              Accept: 'application/json, text/plain, */*'